; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v5 - type_1 ?v1 - type_3)
 	      (pred_4 ?v4 - object ?v1 - type_3)
	      (pred_2 ?v5 - type_1 ?v7 - type_2)
	      (pred_3 ?v5 - type_1 ?v4 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v5 - type_1 ?v3 ?v8 - type_3)
       :precondition (and  (pred_1 ?v5 ?v3))
       :effect (and  (pred_1 ?v5 ?v8)
		     (not (pred_1 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_1 ?v2 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v6) (pred_1 ?v5 ?v6) (pred_2 ?v5 ?v7))
       :effect (and (pred_3 ?v5 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v6)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_1 ?v2 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v2 ?v7) (pred_1 ?v5 ?v6))
       :effect (and (pred_4 ?v2 ?v6)
		    (pred_2 ?v5 ?v7)
		    (not (pred_3 ?v5 ?v2 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_1
obj_06 obj_09 - type_2
obj_07 obj_01 obj_05 obj_02 - type_3
obj_03 obj_04 obj_08 - object)
(:init
(pred_1 obj_10 obj_02)
(pred_2 obj_10 obj_06)
(pred_2 obj_10 obj_09)
(pred_4 obj_03 obj_07)
(pred_4 obj_04 obj_05)
(pred_4 obj_08 obj_01)
)
(:goal
(and
(pred_4 obj_03 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_08 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_10 ?b obj_09))))
)
)

; plan
1. (op_3 obj_10 obj_02 obj_07)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_07)
   goals met: 0 of 3
2. (op_2 obj_10 obj_03 obj_07 obj_06)
   deleted: (pred_4 obj_03 obj_07) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_03 obj_06)
   goals met: 0 of 3
3. (op_3 obj_10 obj_07 obj_02)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_02)
   goals met: 0 of 3
4. (op_1 obj_10 obj_03 obj_02 obj_06)
   deleted: (pred_3 obj_10 obj_03 obj_06)
   added: (pred_4 obj_03 obj_02) (pred_2 obj_10 obj_06)
   goals met: 1 of 3
5. (op_3 obj_10 obj_02 obj_05)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_05)
   goals met: 1 of 3
6. (op_2 obj_10 obj_04 obj_05 obj_06)
   deleted: (pred_4 obj_04 obj_05) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_04 obj_06)
   goals met: 1 of 3
7. (op_3 obj_10 obj_05 obj_02)
   deleted: (pred_1 obj_10 obj_05)
   added: (pred_1 obj_10 obj_02)
   goals met: 1 of 3
8. (op_1 obj_10 obj_04 obj_02 obj_06)
   deleted: (pred_3 obj_10 obj_04 obj_06)
   added: (pred_4 obj_04 obj_02) (pred_2 obj_10 obj_06)
   goals met: 2 of 3
9. (op_3 obj_10 obj_02 obj_01)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_01)
   goals met: 2 of 3
10. (op_2 obj_10 obj_08 obj_01 obj_06)
   deleted: (pred_4 obj_08 obj_01) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_08 obj_06)
   goals met: 2 of 3
11. (op_3 obj_10 obj_01 obj_07)
   deleted: (pred_1 obj_10 obj_01)
   added: (pred_1 obj_10 obj_07)
   goals met: 2 of 3
12. (op_1 obj_10 obj_08 obj_07 obj_06)
   deleted: (pred_3 obj_10 obj_08 obj_06)
   added: (pred_4 obj_08 obj_07) (pred_2 obj_10 obj_06)
   goals met: 3 of 3
